controllers/PostsController.php

INSERT INTO `posts` (`post_title`, `post_description`, `author_id`) VALUES ('Título Posts', 'Descrição posts', '1')
---
    public function actionCreate()
    {
        $model = new Posts();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `posts` WHERE `post_id`='2'
---
    protected function findModel($id)
    {
        if (($model = Posts::findOne($id)) !== null) {